#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DLCBoxEvent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DLCBoxEvent.BP_DLCBoxEvent_C.OnStartDLCBoxEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_DLCBoxEvent_C_OnStartDLCBoxEffect final
{
public:
	bool                                          IsBeginPlay;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DLCBoxEvent_C_OnStartDLCBoxEffect) == 0x000001, "Wrong alignment on BP_DLCBoxEvent_C_OnStartDLCBoxEffect");
static_assert(sizeof(BP_DLCBoxEvent_C_OnStartDLCBoxEffect) == 0x000001, "Wrong size on BP_DLCBoxEvent_C_OnStartDLCBoxEffect");
static_assert(offsetof(BP_DLCBoxEvent_C_OnStartDLCBoxEffect, IsBeginPlay) == 0x000000, "Member 'BP_DLCBoxEvent_C_OnStartDLCBoxEffect::IsBeginPlay' has a wrong offset!");

// Function BP_DLCBoxEvent.BP_DLCBoxEvent_C.OnEndDLCBoxEffect
// 0x0001 (0x0001 - 0x0000)
struct BP_DLCBoxEvent_C_OnEndDLCBoxEffect final
{
public:
	bool                                          IsEndPlay;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DLCBoxEvent_C_OnEndDLCBoxEffect) == 0x000001, "Wrong alignment on BP_DLCBoxEvent_C_OnEndDLCBoxEffect");
static_assert(sizeof(BP_DLCBoxEvent_C_OnEndDLCBoxEffect) == 0x000001, "Wrong size on BP_DLCBoxEvent_C_OnEndDLCBoxEffect");
static_assert(offsetof(BP_DLCBoxEvent_C_OnEndDLCBoxEffect, IsEndPlay) == 0x000000, "Member 'BP_DLCBoxEvent_C_OnEndDLCBoxEffect::IsEndPlay' has a wrong offset!");

// Function BP_DLCBoxEvent.BP_DLCBoxEvent_C.ExecuteUbergraph_BP_DLCBoxEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsBeginPlay;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsEndPlay;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent) == 0x000004, "Wrong alignment on BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent");
static_assert(sizeof(BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent) == 0x000008, "Wrong size on BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent");
static_assert(offsetof(BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent, EntryPoint) == 0x000000, "Member 'BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent, K2Node_Event_IsBeginPlay) == 0x000004, "Member 'BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent::K2Node_Event_IsBeginPlay' has a wrong offset!");
static_assert(offsetof(BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent, K2Node_Event_IsEndPlay) == 0x000005, "Member 'BP_DLCBoxEvent_C_ExecuteUbergraph_BP_DLCBoxEvent::K2Node_Event_IsEndPlay' has a wrong offset!");

}

