#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Nicola

#include "Basic.hpp"

#include "ADSound_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Nicola_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "CriWareRuntime_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Nicola.TriggerEventActor.GetTriggerType
// 0x0001 (0x0001 - 0x0000)
struct TriggerEventActor_GetTriggerType final
{
public:
	EEventTriggerType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TriggerEventActor_GetTriggerType) == 0x000001, "Wrong alignment on TriggerEventActor_GetTriggerType");
static_assert(sizeof(TriggerEventActor_GetTriggerType) == 0x000001, "Wrong size on TriggerEventActor_GetTriggerType");
static_assert(offsetof(TriggerEventActor_GetTriggerType, ReturnValue) == 0x000000, "Member 'TriggerEventActor_GetTriggerType::ReturnValue' has a wrong offset!");

// Function Nicola.ActorListMan.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct ActorListMan_GetInstance final
{
public:
	class UActorListMan*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorListMan_GetInstance) == 0x000008, "Wrong alignment on ActorListMan_GetInstance");
static_assert(sizeof(ActorListMan_GetInstance) == 0x000008, "Wrong size on ActorListMan_GetInstance");
static_assert(offsetof(ActorListMan_GetInstance, ReturnValue) == 0x000000, "Member 'ActorListMan_GetInstance::ReturnValue' has a wrong offset!");

// Function Nicola.ActorListMan.GetActorList
// 0x0018 (0x0018 - 0x0000)
struct ActorListMan_GetActorList final
{
public:
	EActorType                                    actorType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorListMan_GetActorList) == 0x000008, "Wrong alignment on ActorListMan_GetActorList");
static_assert(sizeof(ActorListMan_GetActorList) == 0x000018, "Wrong size on ActorListMan_GetActorList");
static_assert(offsetof(ActorListMan_GetActorList, actorType) == 0x000000, "Member 'ActorListMan_GetActorList::actorType' has a wrong offset!");
static_assert(offsetof(ActorListMan_GetActorList, ReturnValue) == 0x000008, "Member 'ActorListMan_GetActorList::ReturnValue' has a wrong offset!");

// Function Nicola.ActorListMan.GetActorListInRange
// 0x0028 (0x0028 - 0x0000)
struct ActorListMan_GetActorListInRange final
{
public:
	EActorType                                    actorType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Center;                                            // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreZ;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorListMan_GetActorListInRange) == 0x000008, "Wrong alignment on ActorListMan_GetActorListInRange");
static_assert(sizeof(ActorListMan_GetActorListInRange) == 0x000028, "Wrong size on ActorListMan_GetActorListInRange");
static_assert(offsetof(ActorListMan_GetActorListInRange, actorType) == 0x000000, "Member 'ActorListMan_GetActorListInRange::actorType' has a wrong offset!");
static_assert(offsetof(ActorListMan_GetActorListInRange, Center) == 0x000004, "Member 'ActorListMan_GetActorListInRange::Center' has a wrong offset!");
static_assert(offsetof(ActorListMan_GetActorListInRange, Radius) == 0x000010, "Member 'ActorListMan_GetActorListInRange::Radius' has a wrong offset!");
static_assert(offsetof(ActorListMan_GetActorListInRange, bIgnoreZ) == 0x000014, "Member 'ActorListMan_GetActorListInRange::bIgnoreZ' has a wrong offset!");
static_assert(offsetof(ActorListMan_GetActorListInRange, ReturnValue) == 0x000018, "Member 'ActorListMan_GetActorListInRange::ReturnValue' has a wrong offset!");

// Function Nicola.LevelLoaderActor.OnOverlapBegin
// 0x00A8 (0x00A8 - 0x0000)
struct LevelLoaderActor_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelLoaderActor_OnOverlapBegin) == 0x000008, "Wrong alignment on LevelLoaderActor_OnOverlapBegin");
static_assert(sizeof(LevelLoaderActor_OnOverlapBegin) == 0x0000A8, "Wrong size on LevelLoaderActor_OnOverlapBegin");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, OverlappedComp) == 0x000000, "Member 'LevelLoaderActor_OnOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, OtherActor) == 0x000008, "Member 'LevelLoaderActor_OnOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, OtherComp) == 0x000010, "Member 'LevelLoaderActor_OnOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'LevelLoaderActor_OnOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, bFromSweep) == 0x00001C, "Member 'LevelLoaderActor_OnOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(LevelLoaderActor_OnOverlapBegin, SweepResult) == 0x000020, "Member 'LevelLoaderActor_OnOverlapBegin::SweepResult' has a wrong offset!");

// Function Nicola.ButtonGuideComponent.BP_ShowButtonGuide
// 0x0008 (0x0008 - 0x0000)
struct ButtonGuideComponent_BP_ShowButtonGuide final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ButtonGuideComponent_BP_ShowButtonGuide) == 0x000004, "Wrong alignment on ButtonGuideComponent_BP_ShowButtonGuide");
static_assert(sizeof(ButtonGuideComponent_BP_ShowButtonGuide) == 0x000008, "Wrong size on ButtonGuideComponent_BP_ShowButtonGuide");
static_assert(offsetof(ButtonGuideComponent_BP_ShowButtonGuide, ID) == 0x000000, "Member 'ButtonGuideComponent_BP_ShowButtonGuide::ID' has a wrong offset!");

// Function Nicola.NicolaPaperFlipbookComponent.PlayNewFlipbook
// 0x0018 (0x0018 - 0x0000)
struct NicolaPaperFlipbookComponent_PlayNewFlipbook final
{
public:
	class UPaperFlipbook*                         NewFlipbook;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         mReservedStartFrame;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mReservedPlayRate;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPaperFlipbookComponent_PlayNewFlipbook) == 0x000008, "Wrong alignment on NicolaPaperFlipbookComponent_PlayNewFlipbook");
static_assert(sizeof(NicolaPaperFlipbookComponent_PlayNewFlipbook) == 0x000018, "Wrong size on NicolaPaperFlipbookComponent_PlayNewFlipbook");
static_assert(offsetof(NicolaPaperFlipbookComponent_PlayNewFlipbook, NewFlipbook) == 0x000000, "Member 'NicolaPaperFlipbookComponent_PlayNewFlipbook::NewFlipbook' has a wrong offset!");
static_assert(offsetof(NicolaPaperFlipbookComponent_PlayNewFlipbook, bLoop) == 0x000008, "Member 'NicolaPaperFlipbookComponent_PlayNewFlipbook::bLoop' has a wrong offset!");
static_assert(offsetof(NicolaPaperFlipbookComponent_PlayNewFlipbook, bReverse) == 0x000009, "Member 'NicolaPaperFlipbookComponent_PlayNewFlipbook::bReverse' has a wrong offset!");
static_assert(offsetof(NicolaPaperFlipbookComponent_PlayNewFlipbook, mReservedStartFrame) == 0x00000C, "Member 'NicolaPaperFlipbookComponent_PlayNewFlipbook::mReservedStartFrame' has a wrong offset!");
static_assert(offsetof(NicolaPaperFlipbookComponent_PlayNewFlipbook, mReservedPlayRate) == 0x000010, "Member 'NicolaPaperFlipbookComponent_PlayNewFlipbook::mReservedPlayRate' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugGetDlcFlags
// 0x0008 (0x0008 - 0x0000)
struct NicolaPlatformDebugFL_DebugGetDlcFlags final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugGetDlcFlags) == 0x000004, "Wrong alignment on NicolaPlatformDebugFL_DebugGetDlcFlags");
static_assert(sizeof(NicolaPlatformDebugFL_DebugGetDlcFlags) == 0x000008, "Wrong size on NicolaPlatformDebugFL_DebugGetDlcFlags");
static_assert(offsetof(NicolaPlatformDebugFL_DebugGetDlcFlags, ID) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugGetDlcFlags::ID' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugGetDlcFlags, ReturnValue) == 0x000004, "Member 'NicolaPlatformDebugFL_DebugGetDlcFlags::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetDisplayTestConsoleCommand
// 0x0020 (0x0020 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InCmd;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InQuality;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand) == 0x000020, "Wrong size on NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand, InCmd) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand::InCmd' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand, InQuality) == 0x000018, "Member 'NicolaPlatformDebugFL_DebugSetDisplayTestConsoleCommand::InQuality' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetDlcFlags
// 0x0008 (0x0008 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetDlcFlags final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetDlcFlags) == 0x000004, "Wrong alignment on NicolaPlatformDebugFL_DebugSetDlcFlags");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetDlcFlags) == 0x000008, "Wrong size on NicolaPlatformDebugFL_DebugSetDlcFlags");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetDlcFlags, ID) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetDlcFlags::ID' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetDlcFlags, InFlag) == 0x000004, "Member 'NicolaPlatformDebugFL_DebugSetDlcFlags::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetMaxFps
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetMaxFps final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FPS;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetMaxFps) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetMaxFps");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetMaxFps) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetMaxFps");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMaxFps, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetMaxFps::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMaxFps, FPS) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetMaxFps::FPS' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetMouseCursorVisibility
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetMouseCursorVisibility final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetMouseCursorVisibility) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetMouseCursorVisibility");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetMouseCursorVisibility) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetMouseCursorVisibility");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMouseCursorVisibility, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetMouseCursorVisibility::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMouseCursorVisibility, InFlag) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetMouseCursorVisibility::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetMouseLockMode
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetMouseLockMode final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetMouseLockMode) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetMouseLockMode");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetMouseLockMode) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetMouseLockMode");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMouseLockMode, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetMouseLockMode::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetMouseLockMode, InFlag) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetMouseLockMode::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetShowMouseCursorAlways
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways, InFlag) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetShowMouseCursorAlways::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetUnfocusPadEnable
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetUnfocusPadEnable final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetUnfocusPadEnable) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetUnfocusPadEnable");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetUnfocusPadEnable) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetUnfocusPadEnable");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetUnfocusPadEnable, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetUnfocusPadEnable::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetUnfocusPadEnable, InFlag) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetUnfocusPadEnable::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetUnfocusSoundEnable
// 0x0001 (0x0001 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable) == 0x000001, "Wrong alignment on NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable) == 0x000001, "Wrong size on NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable, InFlag) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetUnfocusSoundEnable::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetVSync
// 0x0010 (0x0010 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetVSync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InFlag;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetVSync) == 0x000008, "Wrong alignment on NicolaPlatformDebugFL_DebugSetVSync");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetVSync) == 0x000010, "Wrong size on NicolaPlatformDebugFL_DebugSetVSync");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetVSync, WorldContextObject) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetVSync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetVSync, InFlag) == 0x000008, "Member 'NicolaPlatformDebugFL_DebugSetVSync::InFlag' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetWindowMode
// 0x0001 (0x0001 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetWindowMode final
{
public:
	EWindowMode                                   InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetWindowMode) == 0x000001, "Wrong alignment on NicolaPlatformDebugFL_DebugSetWindowMode");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetWindowMode) == 0x000001, "Wrong size on NicolaPlatformDebugFL_DebugSetWindowMode");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetWindowMode, InMode) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetWindowMode::InMode' has a wrong offset!");

// Function Nicola.NicolaPlatformDebugFL.DebugSetWindowResolution
// 0x0008 (0x0008 - 0x0000)
struct NicolaPlatformDebugFL_DebugSetWindowResolution final
{
public:
	struct FIntPoint                              InResolution;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaPlatformDebugFL_DebugSetWindowResolution) == 0x000004, "Wrong alignment on NicolaPlatformDebugFL_DebugSetWindowResolution");
static_assert(sizeof(NicolaPlatformDebugFL_DebugSetWindowResolution) == 0x000008, "Wrong size on NicolaPlatformDebugFL_DebugSetWindowResolution");
static_assert(offsetof(NicolaPlatformDebugFL_DebugSetWindowResolution, InResolution) == 0x000000, "Member 'NicolaPlatformDebugFL_DebugSetWindowResolution::InResolution' has a wrong offset!");

// Function Nicola.NicolaMiscFL.ExecConsoleCommand
// 0x0030 (0x0030 - 0x0000)
struct NicolaMiscFL_ExecConsoleCommand final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Command;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerId;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_ExecConsoleCommand) == 0x000008, "Wrong alignment on NicolaMiscFL_ExecConsoleCommand");
static_assert(sizeof(NicolaMiscFL_ExecConsoleCommand) == 0x000030, "Wrong size on NicolaMiscFL_ExecConsoleCommand");
static_assert(offsetof(NicolaMiscFL_ExecConsoleCommand, WorldContextObject) == 0x000000, "Member 'NicolaMiscFL_ExecConsoleCommand::WorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_ExecConsoleCommand, Command) == 0x000008, "Member 'NicolaMiscFL_ExecConsoleCommand::Command' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_ExecConsoleCommand, PlayerId) == 0x000018, "Member 'NicolaMiscFL_ExecConsoleCommand::PlayerId' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_ExecConsoleCommand, ReturnValue) == 0x000020, "Member 'NicolaMiscFL_ExecConsoleCommand::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.GetActorLevel
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_GetActorLevel final
{
public:
	class AActor*                                 TARGET;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevel*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_GetActorLevel) == 0x000008, "Wrong alignment on NicolaMiscFL_GetActorLevel");
static_assert(sizeof(NicolaMiscFL_GetActorLevel) == 0x000010, "Wrong size on NicolaMiscFL_GetActorLevel");
static_assert(offsetof(NicolaMiscFL_GetActorLevel, TARGET) == 0x000000, "Member 'NicolaMiscFL_GetActorLevel::TARGET' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_GetActorLevel, ReturnValue) == 0x000008, "Member 'NicolaMiscFL_GetActorLevel::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.GetMeshNumTriangles
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_GetMeshNumTriangles final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         lod;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_GetMeshNumTriangles) == 0x000008, "Wrong alignment on NicolaMiscFL_GetMeshNumTriangles");
static_assert(sizeof(NicolaMiscFL_GetMeshNumTriangles) == 0x000010, "Wrong size on NicolaMiscFL_GetMeshNumTriangles");
static_assert(offsetof(NicolaMiscFL_GetMeshNumTriangles, Mesh) == 0x000000, "Member 'NicolaMiscFL_GetMeshNumTriangles::Mesh' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_GetMeshNumTriangles, lod) == 0x000008, "Member 'NicolaMiscFL_GetMeshNumTriangles::lod' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_GetMeshNumTriangles, ReturnValue) == 0x00000C, "Member 'NicolaMiscFL_GetMeshNumTriangles::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.HasActorBegunPlay
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_HasActorBegunPlay final
{
public:
	class AActor*                                 TARGET;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaMiscFL_HasActorBegunPlay) == 0x000008, "Wrong alignment on NicolaMiscFL_HasActorBegunPlay");
static_assert(sizeof(NicolaMiscFL_HasActorBegunPlay) == 0x000010, "Wrong size on NicolaMiscFL_HasActorBegunPlay");
static_assert(offsetof(NicolaMiscFL_HasActorBegunPlay, TARGET) == 0x000000, "Member 'NicolaMiscFL_HasActorBegunPlay::TARGET' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_HasActorBegunPlay, ReturnValue) == 0x000008, "Member 'NicolaMiscFL_HasActorBegunPlay::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.IsEditing
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_IsEditing final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaMiscFL_IsEditing) == 0x000008, "Wrong alignment on NicolaMiscFL_IsEditing");
static_assert(sizeof(NicolaMiscFL_IsEditing) == 0x000010, "Wrong size on NicolaMiscFL_IsEditing");
static_assert(offsetof(NicolaMiscFL_IsEditing, InWorldContextObject) == 0x000000, "Member 'NicolaMiscFL_IsEditing::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_IsEditing, ReturnValue) == 0x000008, "Member 'NicolaMiscFL_IsEditing::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.IsVisibleLevel
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_IsVisibleLevel final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaMiscFL_IsVisibleLevel) == 0x000008, "Wrong alignment on NicolaMiscFL_IsVisibleLevel");
static_assert(sizeof(NicolaMiscFL_IsVisibleLevel) == 0x000010, "Wrong size on NicolaMiscFL_IsVisibleLevel");
static_assert(offsetof(NicolaMiscFL_IsVisibleLevel, Level) == 0x000000, "Member 'NicolaMiscFL_IsVisibleLevel::Level' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_IsVisibleLevel, ReturnValue) == 0x000008, "Member 'NicolaMiscFL_IsVisibleLevel::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.IsWithEditor
// 0x0001 (0x0001 - 0x0000)
struct NicolaMiscFL_IsWithEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_IsWithEditor) == 0x000001, "Wrong alignment on NicolaMiscFL_IsWithEditor");
static_assert(sizeof(NicolaMiscFL_IsWithEditor) == 0x000001, "Wrong size on NicolaMiscFL_IsWithEditor");
static_assert(offsetof(NicolaMiscFL_IsWithEditor, ReturnValue) == 0x000000, "Member 'NicolaMiscFL_IsWithEditor::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.SetVisibleActor
// 0x0010 (0x0010 - 0x0000)
struct NicolaMiscFL_SetVisibleActor final
{
public:
	class AActor*                                 TARGET;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisible;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NicolaMiscFL_SetVisibleActor) == 0x000008, "Wrong alignment on NicolaMiscFL_SetVisibleActor");
static_assert(sizeof(NicolaMiscFL_SetVisibleActor) == 0x000010, "Wrong size on NicolaMiscFL_SetVisibleActor");
static_assert(offsetof(NicolaMiscFL_SetVisibleActor, TARGET) == 0x000000, "Member 'NicolaMiscFL_SetVisibleActor::TARGET' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_SetVisibleActor, IsVisible) == 0x000008, "Member 'NicolaMiscFL_SetVisibleActor::IsVisible' has a wrong offset!");

// Function Nicola.NicolaMiscFL.SortStringArray
// 0x0020 (0x0020 - 0x0000)
struct NicolaMiscFL_SortStringArray final
{
public:
	TArray<class FString>                         Values;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_SortStringArray) == 0x000008, "Wrong alignment on NicolaMiscFL_SortStringArray");
static_assert(sizeof(NicolaMiscFL_SortStringArray) == 0x000020, "Wrong size on NicolaMiscFL_SortStringArray");
static_assert(offsetof(NicolaMiscFL_SortStringArray, Values) == 0x000000, "Member 'NicolaMiscFL_SortStringArray::Values' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_SortStringArray, ReturnValue) == 0x000010, "Member 'NicolaMiscFL_SortStringArray::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.SplitPath
// 0x0040 (0x0040 - 0x0000)
struct NicolaMiscFL_SplitPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DirPart;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilenamePart;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtensionPart;                                     // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_SplitPath) == 0x000008, "Wrong alignment on NicolaMiscFL_SplitPath");
static_assert(sizeof(NicolaMiscFL_SplitPath) == 0x000040, "Wrong size on NicolaMiscFL_SplitPath");
static_assert(offsetof(NicolaMiscFL_SplitPath, Path) == 0x000000, "Member 'NicolaMiscFL_SplitPath::Path' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_SplitPath, DirPart) == 0x000010, "Member 'NicolaMiscFL_SplitPath::DirPart' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_SplitPath, FilenamePart) == 0x000020, "Member 'NicolaMiscFL_SplitPath::FilenamePart' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_SplitPath, ExtensionPart) == 0x000030, "Member 'NicolaMiscFL_SplitPath::ExtensionPart' has a wrong offset!");

// Function Nicola.NicolaMiscFL.StringArrayToTextArray
// 0x0020 (0x0020 - 0x0000)
struct NicolaMiscFL_StringArrayToTextArray final
{
public:
	TArray<class FString>                         Values;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FText>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_StringArrayToTextArray) == 0x000008, "Wrong alignment on NicolaMiscFL_StringArrayToTextArray");
static_assert(sizeof(NicolaMiscFL_StringArrayToTextArray) == 0x000020, "Wrong size on NicolaMiscFL_StringArrayToTextArray");
static_assert(offsetof(NicolaMiscFL_StringArrayToTextArray, Values) == 0x000000, "Member 'NicolaMiscFL_StringArrayToTextArray::Values' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_StringArrayToTextArray, ReturnValue) == 0x000010, "Member 'NicolaMiscFL_StringArrayToTextArray::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.StringSetToSortedArray
// 0x0060 (0x0060 - 0x0000)
struct NicolaMiscFL_StringSetToSortedArray final
{
public:
	TSet<class FString>                           Values;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_StringSetToSortedArray) == 0x000008, "Wrong alignment on NicolaMiscFL_StringSetToSortedArray");
static_assert(sizeof(NicolaMiscFL_StringSetToSortedArray) == 0x000060, "Wrong size on NicolaMiscFL_StringSetToSortedArray");
static_assert(offsetof(NicolaMiscFL_StringSetToSortedArray, Values) == 0x000000, "Member 'NicolaMiscFL_StringSetToSortedArray::Values' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_StringSetToSortedArray, ReturnValue) == 0x000050, "Member 'NicolaMiscFL_StringSetToSortedArray::ReturnValue' has a wrong offset!");

// Function Nicola.NicolaMiscFL.TextArrayToStringArray
// 0x0020 (0x0020 - 0x0000)
struct NicolaMiscFL_TextArrayToStringArray final
{
public:
	TArray<class FText>                           Values;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NicolaMiscFL_TextArrayToStringArray) == 0x000008, "Wrong alignment on NicolaMiscFL_TextArrayToStringArray");
static_assert(sizeof(NicolaMiscFL_TextArrayToStringArray) == 0x000020, "Wrong size on NicolaMiscFL_TextArrayToStringArray");
static_assert(offsetof(NicolaMiscFL_TextArrayToStringArray, Values) == 0x000000, "Member 'NicolaMiscFL_TextArrayToStringArray::Values' has a wrong offset!");
static_assert(offsetof(NicolaMiscFL_TextArrayToStringArray, ReturnValue) == 0x000010, "Member 'NicolaMiscFL_TextArrayToStringArray::ReturnValue' has a wrong offset!");

// Function Nicola.BattleBlendActor.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct BattleBlendActor_SetEnable final
{
public:
	bool                                          menable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleBlendActor_SetEnable) == 0x000001, "Wrong alignment on BattleBlendActor_SetEnable");
static_assert(sizeof(BattleBlendActor_SetEnable) == 0x000001, "Wrong size on BattleBlendActor_SetEnable");
static_assert(offsetof(BattleBlendActor_SetEnable, menable) == 0x000000, "Member 'BattleBlendActor_SetEnable::menable' has a wrong offset!");

// Function Nicola.BattleBlendActor.SetRate
// 0x0004 (0x0004 - 0x0000)
struct BattleBlendActor_SetRate final
{
public:
	float                                         mrate;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleBlendActor_SetRate) == 0x000004, "Wrong alignment on BattleBlendActor_SetRate");
static_assert(sizeof(BattleBlendActor_SetRate) == 0x000004, "Wrong size on BattleBlendActor_SetRate");
static_assert(offsetof(BattleBlendActor_SetRate, mrate) == 0x000000, "Member 'BattleBlendActor_SetRate::mrate' has a wrong offset!");

// Function Nicola.BattleCameraControl.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct BattleCameraControl_GetInstance final
{
public:
	class ABattleCameraControl*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_GetInstance) == 0x000008, "Wrong alignment on BattleCameraControl_GetInstance");
static_assert(sizeof(BattleCameraControl_GetInstance) == 0x000008, "Wrong size on BattleCameraControl_GetInstance");
static_assert(offsetof(BattleCameraControl_GetInstance, ReturnValue) == 0x000000, "Member 'BattleCameraControl_GetInstance::ReturnValue' has a wrong offset!");

// Function Nicola.BattleCameraControl.ChangeBattleCameraByIndex
// 0x000C (0x000C - 0x0000)
struct BattleCameraControl_ChangeBattleCameraByIndex final
{
public:
	int32                                         typeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          misFree;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattleCameraControl_ChangeBattleCameraByIndex) == 0x000004, "Wrong alignment on BattleCameraControl_ChangeBattleCameraByIndex");
static_assert(sizeof(BattleCameraControl_ChangeBattleCameraByIndex) == 0x00000C, "Wrong size on BattleCameraControl_ChangeBattleCameraByIndex");
static_assert(offsetof(BattleCameraControl_ChangeBattleCameraByIndex, typeIndex) == 0x000000, "Member 'BattleCameraControl_ChangeBattleCameraByIndex::typeIndex' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_ChangeBattleCameraByIndex, BlendTime) == 0x000004, "Member 'BattleCameraControl_ChangeBattleCameraByIndex::BlendTime' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_ChangeBattleCameraByIndex, misFree) == 0x000008, "Member 'BattleCameraControl_ChangeBattleCameraByIndex::misFree' has a wrong offset!");

// Function Nicola.BattleCameraControl.ChangeScaleMode
// 0x0001 (0x0001 - 0x0000)
struct BattleCameraControl_ChangeScaleMode final
{
public:
	EBattleTestActorMode                          Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_ChangeScaleMode) == 0x000001, "Wrong alignment on BattleCameraControl_ChangeScaleMode");
static_assert(sizeof(BattleCameraControl_ChangeScaleMode) == 0x000001, "Wrong size on BattleCameraControl_ChangeScaleMode");
static_assert(offsetof(BattleCameraControl_ChangeScaleMode, Mode) == 0x000000, "Member 'BattleCameraControl_ChangeScaleMode::Mode' has a wrong offset!");

// Function Nicola.BattleCameraControl.DebugGetMonsterLocation
// 0x001C (0x001C - 0x0000)
struct BattleCameraControl_DebugGetMonsterLocation final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                outWorldLocation;                                  // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                outRelativeLocation;                               // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_DebugGetMonsterLocation) == 0x000004, "Wrong alignment on BattleCameraControl_DebugGetMonsterLocation");
static_assert(sizeof(BattleCameraControl_DebugGetMonsterLocation) == 0x00001C, "Wrong size on BattleCameraControl_DebugGetMonsterLocation");
static_assert(offsetof(BattleCameraControl_DebugGetMonsterLocation, SlotIndex) == 0x000000, "Member 'BattleCameraControl_DebugGetMonsterLocation::SlotIndex' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_DebugGetMonsterLocation, outWorldLocation) == 0x000004, "Member 'BattleCameraControl_DebugGetMonsterLocation::outWorldLocation' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_DebugGetMonsterLocation, outRelativeLocation) == 0x000010, "Member 'BattleCameraControl_DebugGetMonsterLocation::outRelativeLocation' has a wrong offset!");

// Function Nicola.BattleCameraControl.DebugGetPlayerLocation
// 0x001C (0x001C - 0x0000)
struct BattleCameraControl_DebugGetPlayerLocation final
{
public:
	int32                                         formationIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                outWorldLocation;                                  // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                outRelativeLocation;                               // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_DebugGetPlayerLocation) == 0x000004, "Wrong alignment on BattleCameraControl_DebugGetPlayerLocation");
static_assert(sizeof(BattleCameraControl_DebugGetPlayerLocation) == 0x00001C, "Wrong size on BattleCameraControl_DebugGetPlayerLocation");
static_assert(offsetof(BattleCameraControl_DebugGetPlayerLocation, formationIndex) == 0x000000, "Member 'BattleCameraControl_DebugGetPlayerLocation::formationIndex' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_DebugGetPlayerLocation, outWorldLocation) == 0x000004, "Member 'BattleCameraControl_DebugGetPlayerLocation::outWorldLocation' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_DebugGetPlayerLocation, outRelativeLocation) == 0x000010, "Member 'BattleCameraControl_DebugGetPlayerLocation::outRelativeLocation' has a wrong offset!");

// Function Nicola.BattleCameraControl.GetCameraActor
// 0x0010 (0x0010 - 0x0000)
struct BattleCameraControl_GetCameraActor final
{
public:
	EBattleCameraSettingType                      Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_GetCameraActor) == 0x000008, "Wrong alignment on BattleCameraControl_GetCameraActor");
static_assert(sizeof(BattleCameraControl_GetCameraActor) == 0x000010, "Wrong size on BattleCameraControl_GetCameraActor");
static_assert(offsetof(BattleCameraControl_GetCameraActor, Type) == 0x000000, "Member 'BattleCameraControl_GetCameraActor::Type' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_GetCameraActor, ReturnValue) == 0x000008, "Member 'BattleCameraControl_GetCameraActor::ReturnValue' has a wrong offset!");

// Function Nicola.BattleCameraControl.GetEnemyBattlePositionLine
// 0x0008 (0x0008 - 0x0000)
struct BattleCameraControl_GetEnemyBattlePositionLine final
{
public:
	class ABattlePositionLine*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_GetEnemyBattlePositionLine) == 0x000008, "Wrong alignment on BattleCameraControl_GetEnemyBattlePositionLine");
static_assert(sizeof(BattleCameraControl_GetEnemyBattlePositionLine) == 0x000008, "Wrong size on BattleCameraControl_GetEnemyBattlePositionLine");
static_assert(offsetof(BattleCameraControl_GetEnemyBattlePositionLine, ReturnValue) == 0x000000, "Member 'BattleCameraControl_GetEnemyBattlePositionLine::ReturnValue' has a wrong offset!");

// Function Nicola.BattleCameraControl.LoadSetting
// 0x0018 (0x0018 - 0x0000)
struct BattleCameraControl_LoadSetting final
{
public:
	class FString                                 settingFile;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBattleCameraSettingType                      Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BattleCameraControl_LoadSetting) == 0x000008, "Wrong alignment on BattleCameraControl_LoadSetting");
static_assert(sizeof(BattleCameraControl_LoadSetting) == 0x000018, "Wrong size on BattleCameraControl_LoadSetting");
static_assert(offsetof(BattleCameraControl_LoadSetting, settingFile) == 0x000000, "Member 'BattleCameraControl_LoadSetting::settingFile' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_LoadSetting, Type) == 0x000010, "Member 'BattleCameraControl_LoadSetting::Type' has a wrong offset!");

// Function Nicola.BattleCameraControl.OnChangeFreeCamera
// 0x0001 (0x0001 - 0x0000)
struct BattleCameraControl_OnChangeFreeCamera final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_OnChangeFreeCamera) == 0x000001, "Wrong alignment on BattleCameraControl_OnChangeFreeCamera");
static_assert(sizeof(BattleCameraControl_OnChangeFreeCamera) == 0x000001, "Wrong size on BattleCameraControl_OnChangeFreeCamera");
static_assert(offsetof(BattleCameraControl_OnChangeFreeCamera, Enable) == 0x000000, "Member 'BattleCameraControl_OnChangeFreeCamera::Enable' has a wrong offset!");

// Function Nicola.BattleCameraControl.OnInput
// 0x0008 (0x0008 - 0x0000)
struct BattleCameraControl_OnInput final
{
public:
	class FName                                   Message;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_OnInput) == 0x000004, "Wrong alignment on BattleCameraControl_OnInput");
static_assert(sizeof(BattleCameraControl_OnInput) == 0x000008, "Wrong size on BattleCameraControl_OnInput");
static_assert(offsetof(BattleCameraControl_OnInput, Message) == 0x000000, "Member 'BattleCameraControl_OnInput::Message' has a wrong offset!");

// Function Nicola.BattleCameraControl.PlaySequenceBackToFront
// 0x0003 (0x0003 - 0x0000)
struct BattleCameraControl_PlaySequenceBackToFront final
{
public:
	bool                                          GoToEndAndStop;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isDragon;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          doCrossFade;                                       // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattleCameraControl_PlaySequenceBackToFront) == 0x000001, "Wrong alignment on BattleCameraControl_PlaySequenceBackToFront");
static_assert(sizeof(BattleCameraControl_PlaySequenceBackToFront) == 0x000003, "Wrong size on BattleCameraControl_PlaySequenceBackToFront");
static_assert(offsetof(BattleCameraControl_PlaySequenceBackToFront, GoToEndAndStop) == 0x000000, "Member 'BattleCameraControl_PlaySequenceBackToFront::GoToEndAndStop' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_PlaySequenceBackToFront, isDragon) == 0x000001, "Member 'BattleCameraControl_PlaySequenceBackToFront::isDragon' has a wrong offset!");
static_assert(offsetof(BattleCameraControl_PlaySequenceBackToFront, doCrossFade) == 0x000002, "Member 'BattleCameraControl_PlaySequenceBackToFront::doCrossFade' has a wrong offset!");

// Function Nicola.BattleCameraControl.PlaySequenceFrontToBack
// 0x0003 (0x0003 - 0x0000)
struct BattleCameraControl_PlaySequenceFrontToBack final
{
public:
	bool                                          GoToEndAndStop;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
