#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NicolaSoundAmbientCoastAreaActor

#include "Basic.hpp"

#include "Nicola_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NicolaSoundAmbientCoastAreaActor.NicolaSoundAmbientCoastAreaActor_C
// 0x0018 (0x0240 - 0x0228)
class ANicolaSoundAmbientCoastAreaActor_C final : public ANicolaSoundAmbientCoastAreaActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__NicolaSoundAmbientCoastAreaActor_Capsule_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__NicolaSoundAmbientCoastAreaActor_Capsule_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_NicolaSoundAmbientCoastAreaActor(int32 EntryPoint);

	class UCapsuleComponent* GetAreaCollisionComponent() const;
	struct FVector GetAreaCollisionCentralAxis() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NicolaSoundAmbientCoastAreaActor_C">();
	}
	static class ANicolaSoundAmbientCoastAreaActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANicolaSoundAmbientCoastAreaActor_C>();
	}
};
static_assert(alignof(ANicolaSoundAmbientCoastAreaActor_C) == 0x000008, "Wrong alignment on ANicolaSoundAmbientCoastAreaActor_C");
static_assert(sizeof(ANicolaSoundAmbientCoastAreaActor_C) == 0x000240, "Wrong size on ANicolaSoundAmbientCoastAreaActor_C");
static_assert(offsetof(ANicolaSoundAmbientCoastAreaActor_C, UberGraphFrame) == 0x000228, "Member 'ANicolaSoundAmbientCoastAreaActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANicolaSoundAmbientCoastAreaActor_C, Capsule) == 0x000230, "Member 'ANicolaSoundAmbientCoastAreaActor_C::Capsule' has a wrong offset!");
static_assert(offsetof(ANicolaSoundAmbientCoastAreaActor_C, DefaultSceneRoot) == 0x000238, "Member 'ANicolaSoundAmbientCoastAreaActor_C::DefaultSceneRoot' has a wrong offset!");

}

