#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleMonsterName

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleMonsterName.WB_BattleMonsterName_C
// 0x0070 (0x0420 - 0x03B0)
class UWB_BattleMonsterName_C final : public UCommonWindowWidget
{
public:
	class UWB_BattleMonsterName_Item_C*           Zero0;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero3;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero4;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero5;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero6;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero7;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero8;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_Item_C*           Zero9;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoRange1;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoRange2;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedRange1;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedRange2;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleMonsterName_C">();
	}
	static class UWB_BattleMonsterName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleMonsterName_C>();
	}
};
static_assert(alignof(UWB_BattleMonsterName_C) == 0x000008, "Wrong alignment on UWB_BattleMonsterName_C");
static_assert(sizeof(UWB_BattleMonsterName_C) == 0x000420, "Wrong size on UWB_BattleMonsterName_C");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero0) == 0x0003B0, "Member 'UWB_BattleMonsterName_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero1) == 0x0003B8, "Member 'UWB_BattleMonsterName_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero2) == 0x0003C0, "Member 'UWB_BattleMonsterName_C::Zero2' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero3) == 0x0003C8, "Member 'UWB_BattleMonsterName_C::Zero3' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero4) == 0x0003D0, "Member 'UWB_BattleMonsterName_C::Zero4' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero5) == 0x0003D8, "Member 'UWB_BattleMonsterName_C::Zero5' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero6) == 0x0003E0, "Member 'UWB_BattleMonsterName_C::Zero6' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero7) == 0x0003E8, "Member 'UWB_BattleMonsterName_C::Zero7' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero8) == 0x0003F0, "Member 'UWB_BattleMonsterName_C::Zero8' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, Zero9) == 0x0003F8, "Member 'UWB_BattleMonsterName_C::Zero9' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, InfoRange1) == 0x000400, "Member 'UWB_BattleMonsterName_C::InfoRange1' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, InfoRange2) == 0x000408, "Member 'UWB_BattleMonsterName_C::InfoRange2' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, SpeedRange1) == 0x000410, "Member 'UWB_BattleMonsterName_C::SpeedRange1' has a wrong offset!");
static_assert(offsetof(UWB_BattleMonsterName_C, SpeedRange2) == 0x000418, "Member 'UWB_BattleMonsterName_C::SpeedRange2' has a wrong offset!");

}

