#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Battle_HideWindow

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Battle_HideWindow.WB_Battle_HideWindow_C
// 0x0020 (0x03D0 - 0x03B0)
class UWB_Battle_HideWindow_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Push;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 Button;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHover;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Battle_HideWindow_C">();
	}
	static class UWB_Battle_HideWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Battle_HideWindow_C>();
	}
};
static_assert(alignof(UWB_Battle_HideWindow_C) == 0x000008, "Wrong alignment on UWB_Battle_HideWindow_C");
static_assert(sizeof(UWB_Battle_HideWindow_C) == 0x0003D0, "Wrong size on UWB_Battle_HideWindow_C");
static_assert(offsetof(UWB_Battle_HideWindow_C, Push) == 0x0003B0, "Member 'UWB_Battle_HideWindow_C::Push' has a wrong offset!");
static_assert(offsetof(UWB_Battle_HideWindow_C, Button) == 0x0003B8, "Member 'UWB_Battle_HideWindow_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_Battle_HideWindow_C, MouseClick) == 0x0003C0, "Member 'UWB_Battle_HideWindow_C::MouseClick' has a wrong offset!");
static_assert(offsetof(UWB_Battle_HideWindow_C, MouseHover) == 0x0003C8, "Member 'UWB_Battle_HideWindow_C::MouseHover' has a wrong offset!");

}

