#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleRetry_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleRetry_Root.WB_BattleRetry_Root_C
// 0x0020 (0x03E0 - 0x03C0)
class UWB_BattleRetry_Root_C final : public UCommonRootWidget
{
public:
	class UWB_BattleRetry_ListTop_C*              ListTop;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleRetry_WindowAutoSave_C*       WindowLoad;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BatttleRetry_WindowResume_C*        WindowResume;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleRetry_WindowItem_Retry_C*     WindowRetry;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleRetry_Root_C">();
	}
	static class UWB_BattleRetry_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleRetry_Root_C>();
	}
};
static_assert(alignof(UWB_BattleRetry_Root_C) == 0x000008, "Wrong alignment on UWB_BattleRetry_Root_C");
static_assert(sizeof(UWB_BattleRetry_Root_C) == 0x0003E0, "Wrong size on UWB_BattleRetry_Root_C");
static_assert(offsetof(UWB_BattleRetry_Root_C, ListTop) == 0x0003C0, "Member 'UWB_BattleRetry_Root_C::ListTop' has a wrong offset!");
static_assert(offsetof(UWB_BattleRetry_Root_C, WindowLoad) == 0x0003C8, "Member 'UWB_BattleRetry_Root_C::WindowLoad' has a wrong offset!");
static_assert(offsetof(UWB_BattleRetry_Root_C, WindowResume) == 0x0003D0, "Member 'UWB_BattleRetry_Root_C::WindowResume' has a wrong offset!");
static_assert(offsetof(UWB_BattleRetry_Root_C, WindowRetry) == 0x0003D8, "Member 'UWB_BattleRetry_Root_C::WindowRetry' has a wrong offset!");

}

