#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleResult_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleResult_Root.WB_BattleResult_Root_C
// 0x0018 (0x03D8 - 0x03C0)
class UWB_BattleResult_Root_C final : public UCommonRootWidget
{
public:
	class UWB_BattleResult_Window2_C*             Magic;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleResult_Window3_C*             Message;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleResult_Window1_C*             Param;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleResult_Root_C">();
	}
	static class UWB_BattleResult_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleResult_Root_C>();
	}
};
static_assert(alignof(UWB_BattleResult_Root_C) == 0x000008, "Wrong alignment on UWB_BattleResult_Root_C");
static_assert(sizeof(UWB_BattleResult_Root_C) == 0x0003D8, "Wrong size on UWB_BattleResult_Root_C");
static_assert(offsetof(UWB_BattleResult_Root_C, Magic) == 0x0003C0, "Member 'UWB_BattleResult_Root_C::Magic' has a wrong offset!");
static_assert(offsetof(UWB_BattleResult_Root_C, Message) == 0x0003C8, "Member 'UWB_BattleResult_Root_C::Message' has a wrong offset!");
static_assert(offsetof(UWB_BattleResult_Root_C, Param) == 0x0003D0, "Member 'UWB_BattleResult_Root_C::Param' has a wrong offset!");

}

