#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleSpeedChange

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleSpeedChange.WB_BattleSpeedChange_C
// 0x0020 (0x03D0 - 0x03B0)
class UWB_BattleSpeedChange_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Push_R;                                            // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push_L;                                            // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ButtonLeft;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ButtonRight;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleSpeedChange_C">();
	}
	static class UWB_BattleSpeedChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleSpeedChange_C>();
	}
};
static_assert(alignof(UWB_BattleSpeedChange_C) == 0x000008, "Wrong alignment on UWB_BattleSpeedChange_C");
static_assert(sizeof(UWB_BattleSpeedChange_C) == 0x0003D0, "Wrong size on UWB_BattleSpeedChange_C");
static_assert(offsetof(UWB_BattleSpeedChange_C, Push_R) == 0x0003B0, "Member 'UWB_BattleSpeedChange_C::Push_R' has a wrong offset!");
static_assert(offsetof(UWB_BattleSpeedChange_C, Push_L) == 0x0003B8, "Member 'UWB_BattleSpeedChange_C::Push_L' has a wrong offset!");
static_assert(offsetof(UWB_BattleSpeedChange_C, ButtonLeft) == 0x0003C0, "Member 'UWB_BattleSpeedChange_C::ButtonLeft' has a wrong offset!");
static_assert(offsetof(UWB_BattleSpeedChange_C, ButtonRight) == 0x0003C8, "Member 'UWB_BattleSpeedChange_C::ButtonRight' has a wrong offset!");

}

