#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Battle_PlayerDamage2_Item_00_LOC

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Battle_PlayerDamage2_Item_00_LOC.WB_Battle_PlayerDamage2_Item_00_LOC_C
// 0x0060 (0x0388 - 0x0328)
class UWB_Battle_PlayerDamage2_Item_00_LOC_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Miss;                                              // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MPRecover;                                         // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Heal;                                              // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MPDamage;                                          // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_00;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_01;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_02;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Number_03;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_0;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Battle_PlayerDamage2_Item_00_LOC_C">();
	}
	static class UWB_Battle_PlayerDamage2_Item_00_LOC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Battle_PlayerDamage2_Item_00_LOC_C>();
	}
};
static_assert(alignof(UWB_Battle_PlayerDamage2_Item_00_LOC_C) == 0x000008, "Wrong alignment on UWB_Battle_PlayerDamage2_Item_00_LOC_C");
static_assert(sizeof(UWB_Battle_PlayerDamage2_Item_00_LOC_C) == 0x000388, "Wrong size on UWB_Battle_PlayerDamage2_Item_00_LOC_C");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Miss) == 0x000328, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Miss' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, MPRecover) == 0x000330, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::MPRecover' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Heal) == 0x000338, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Heal' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, MPDamage) == 0x000340, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::MPDamage' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Normal) == 0x000348, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Normal' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, BG) == 0x000350, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Number_00) == 0x000358, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Number_00' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Number_01) == 0x000360, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Number_01' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Number_02) == 0x000368, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Number_02' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Number_03) == 0x000370, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Number_03' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, Separator) == 0x000378, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::Separator' has a wrong offset!");
static_assert(offsetof(UWB_Battle_PlayerDamage2_Item_00_LOC_C, UIParticle_0) == 0x000380, "Member 'UWB_Battle_PlayerDamage2_Item_00_LOC_C::UIParticle_0' has a wrong offset!");

}

