#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleCommon_Window1

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleCommon_Window1.WB_BattleCommon_Window1_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_BattleCommon_Window1_C final : public UCommonWindowWidget
{
public:
	class UNicolaRichTextBlock*                   ItemText;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleCommon_Window1Item_C*         MPTextItem;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleCommon_Window1_C">();
	}
	static class UWB_BattleCommon_Window1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleCommon_Window1_C>();
	}
};
static_assert(alignof(UWB_BattleCommon_Window1_C) == 0x000008, "Wrong alignment on UWB_BattleCommon_Window1_C");
static_assert(sizeof(UWB_BattleCommon_Window1_C) == 0x0003C8, "Wrong size on UWB_BattleCommon_Window1_C");
static_assert(offsetof(UWB_BattleCommon_Window1_C, ItemText) == 0x0003B0, "Member 'UWB_BattleCommon_Window1_C::ItemText' has a wrong offset!");
static_assert(offsetof(UWB_BattleCommon_Window1_C, MPTextItem) == 0x0003B8, "Member 'UWB_BattleCommon_Window1_C::MPTextItem' has a wrong offset!");
static_assert(offsetof(UWB_BattleCommon_Window1_C, WindowBG) == 0x0003C0, "Member 'UWB_BattleCommon_Window1_C::WindowBG' has a wrong offset!");

}

