#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleUnit_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleUnit_Root.WB_BattleUnit_Root_C
// 0x0050 (0x0410 - 0x03C0)
class UWB_BattleUnit_Root_C final : public UCommonRootWidget
{
public:
	class UWB_BattleEquip_List1_C*                EquipList1;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleEquip_List2_C*                EquipList2;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1_C*         ItemList;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Field_Item_Window1_C*               ItemWindow;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleMagic_List1_C*             MagicList;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleCommon_Window1_C*             MagicWindow;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleUnit_TargetList_C*            TargetList;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleMagic_List2_C*             TargetList2;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleCommon_Dialog_C*              TextWindow;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleCommon_List3x2_C*             UnitList;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleUnit_Root_C">();
	}
	static class UWB_BattleUnit_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleUnit_Root_C>();
	}
};
static_assert(alignof(UWB_BattleUnit_Root_C) == 0x000008, "Wrong alignment on UWB_BattleUnit_Root_C");
static_assert(sizeof(UWB_BattleUnit_Root_C) == 0x000410, "Wrong size on UWB_BattleUnit_Root_C");
static_assert(offsetof(UWB_BattleUnit_Root_C, EquipList1) == 0x0003C0, "Member 'UWB_BattleUnit_Root_C::EquipList1' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, EquipList2) == 0x0003C8, "Member 'UWB_BattleUnit_Root_C::EquipList2' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, ItemList) == 0x0003D0, "Member 'UWB_BattleUnit_Root_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, ItemWindow) == 0x0003D8, "Member 'UWB_BattleUnit_Root_C::ItemWindow' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, MagicList) == 0x0003E0, "Member 'UWB_BattleUnit_Root_C::MagicList' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, MagicWindow) == 0x0003E8, "Member 'UWB_BattleUnit_Root_C::MagicWindow' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, TargetList) == 0x0003F0, "Member 'UWB_BattleUnit_Root_C::TargetList' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, TargetList2) == 0x0003F8, "Member 'UWB_BattleUnit_Root_C::TargetList2' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, TextWindow) == 0x000400, "Member 'UWB_BattleUnit_Root_C::TextWindow' has a wrong offset!");
static_assert(offsetof(UWB_BattleUnit_Root_C, UnitList) == 0x000408, "Member 'UWB_BattleUnit_Root_C::UnitList' has a wrong offset!");

}

