#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattlePlayerStatus_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattlePlayerStatus_Root.WB_BattlePlayerStatus_Root_C
// 0x0030 (0x03F0 - 0x03C0)
class UWB_BattlePlayerStatus_Root_C final : public UCommonRootWidget
{
public:
	class UWB_Battle_MonsterDamage2_C*            M_Damage;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleMonsterName_C*                M_NAME;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Battle_PlayerDamage2_C*             P_Damage;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleSpeedChange_C*                SpeedChange;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattlePlayerStatus_Window_C*        Window;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattlePlayerStatus_Window2_C*       Window2;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattlePlayerStatus_Root_C">();
	}
	static class UWB_BattlePlayerStatus_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattlePlayerStatus_Root_C>();
	}
};
static_assert(alignof(UWB_BattlePlayerStatus_Root_C) == 0x000008, "Wrong alignment on UWB_BattlePlayerStatus_Root_C");
static_assert(sizeof(UWB_BattlePlayerStatus_Root_C) == 0x0003F0, "Wrong size on UWB_BattlePlayerStatus_Root_C");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, M_Damage) == 0x0003C0, "Member 'UWB_BattlePlayerStatus_Root_C::M_Damage' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, M_NAME) == 0x0003C8, "Member 'UWB_BattlePlayerStatus_Root_C::M_NAME' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, P_Damage) == 0x0003D0, "Member 'UWB_BattlePlayerStatus_Root_C::P_Damage' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, SpeedChange) == 0x0003D8, "Member 'UWB_BattlePlayerStatus_Root_C::SpeedChange' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, Window) == 0x0003E0, "Member 'UWB_BattlePlayerStatus_Root_C::Window' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_Root_C, Window2) == 0x0003E8, "Member 'UWB_BattlePlayerStatus_Root_C::Window2' has a wrong offset!");

}

