#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattlePlayerStatus_WindowItem

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattlePlayerStatus_WindowItem.WB_BattlePlayerStatus_WindowItem_C
// 0x0040 (0x03F0 - 0x03B0)
class UWB_BattlePlayerStatus_WindowItem_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Reset;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_Out;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_In;                                          // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_Common_HP_C*                        HP;                                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_MP_C*                        MP;                                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Battle_StatusIcon_Window_C*         StatusIcon;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Highlight;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Highlight2;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattlePlayerStatus_WindowItem_C">();
	}
	static class UWB_BattlePlayerStatus_WindowItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattlePlayerStatus_WindowItem_C>();
	}
};
static_assert(alignof(UWB_BattlePlayerStatus_WindowItem_C) == 0x000008, "Wrong alignment on UWB_BattlePlayerStatus_WindowItem_C");
static_assert(sizeof(UWB_BattlePlayerStatus_WindowItem_C) == 0x0003F0, "Wrong size on UWB_BattlePlayerStatus_WindowItem_C");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, Reset) == 0x0003B0, "Member 'UWB_BattlePlayerStatus_WindowItem_C::Reset' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, Slide_Out) == 0x0003B8, "Member 'UWB_BattlePlayerStatus_WindowItem_C::Slide_Out' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, Slide_In) == 0x0003C0, "Member 'UWB_BattlePlayerStatus_WindowItem_C::Slide_In' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, HP) == 0x0003C8, "Member 'UWB_BattlePlayerStatus_WindowItem_C::HP' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, MP) == 0x0003D0, "Member 'UWB_BattlePlayerStatus_WindowItem_C::MP' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, StatusIcon) == 0x0003D8, "Member 'UWB_BattlePlayerStatus_WindowItem_C::StatusIcon' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, WindowBG_Highlight) == 0x0003E0, "Member 'UWB_BattlePlayerStatus_WindowItem_C::WindowBG_Highlight' has a wrong offset!");
static_assert(offsetof(UWB_BattlePlayerStatus_WindowItem_C, WindowBG_Highlight2) == 0x0003E8, "Member 'UWB_BattlePlayerStatus_WindowItem_C::WindowBG_Highlight2' has a wrong offset!");

}

