#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Battle_StatusIcon

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Battle_StatusIcon.WB_Battle_StatusIcon_C
// 0x0020 (0x0348 - 0x0328)
class UWB_Battle_StatusIcon_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Reset;                                             // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Battle_StatusIcon_C">();
	}
	static class UWB_Battle_StatusIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Battle_StatusIcon_C>();
	}
};
static_assert(alignof(UWB_Battle_StatusIcon_C) == 0x000008, "Wrong alignment on UWB_Battle_StatusIcon_C");
static_assert(sizeof(UWB_Battle_StatusIcon_C) == 0x000348, "Wrong size on UWB_Battle_StatusIcon_C");
static_assert(offsetof(UWB_Battle_StatusIcon_C, Reset) == 0x000328, "Member 'UWB_Battle_StatusIcon_C::Reset' has a wrong offset!");
static_assert(offsetof(UWB_Battle_StatusIcon_C, Out) == 0x000330, "Member 'UWB_Battle_StatusIcon_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_Battle_StatusIcon_C, In) == 0x000338, "Member 'UWB_Battle_StatusIcon_C::In' has a wrong offset!");
static_assert(offsetof(UWB_Battle_StatusIcon_C, ItemIcon) == 0x000340, "Member 'UWB_Battle_StatusIcon_C::ItemIcon' has a wrong offset!");

}

