#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_BattleEquip_List1

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_BattleEquip_List1.WB_BattleEquip_List1_C
// 0x0070 (0x0420 - 0x03B0)
class UWB_BattleEquip_List1_C final : public UCommonListWidget
{
public:
	class UWB_UI_BattleInventory_List1Item_C*     Zero000;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero001;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero002;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero003;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero004;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero005;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero100;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero101;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero102;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero103;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero104;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_UI_BattleInventory_List1Item_C*     Zero105;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_PageText_C*                  Page;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_BattleEquip_List1_C">();
	}
	static class UWB_BattleEquip_List1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_BattleEquip_List1_C>();
	}
};
static_assert(alignof(UWB_BattleEquip_List1_C) == 0x000008, "Wrong alignment on UWB_BattleEquip_List1_C");
static_assert(sizeof(UWB_BattleEquip_List1_C) == 0x000420, "Wrong size on UWB_BattleEquip_List1_C");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero000) == 0x0003B0, "Member 'UWB_BattleEquip_List1_C::Zero000' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero001) == 0x0003B8, "Member 'UWB_BattleEquip_List1_C::Zero001' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero002) == 0x0003C0, "Member 'UWB_BattleEquip_List1_C::Zero002' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero003) == 0x0003C8, "Member 'UWB_BattleEquip_List1_C::Zero003' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero004) == 0x0003D0, "Member 'UWB_BattleEquip_List1_C::Zero004' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero005) == 0x0003D8, "Member 'UWB_BattleEquip_List1_C::Zero005' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero100) == 0x0003E0, "Member 'UWB_BattleEquip_List1_C::Zero100' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero101) == 0x0003E8, "Member 'UWB_BattleEquip_List1_C::Zero101' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero102) == 0x0003F0, "Member 'UWB_BattleEquip_List1_C::Zero102' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero103) == 0x0003F8, "Member 'UWB_BattleEquip_List1_C::Zero103' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero104) == 0x000400, "Member 'UWB_BattleEquip_List1_C::Zero104' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Zero105) == 0x000408, "Member 'UWB_BattleEquip_List1_C::Zero105' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, Page) == 0x000410, "Member 'UWB_BattleEquip_List1_C::Page' has a wrong offset!");
static_assert(offsetof(UWB_BattleEquip_List1_C, WindowBG) == 0x000418, "Member 'UWB_BattleEquip_List1_C::WindowBG' has a wrong offset!");

}

