#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Common_LongPressSet

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Common_LongPressSet.WB_Common_LongPressSet_C
// 0x0028 (0x03B8 - 0x0390)
class UWB_Common_LongPressSet_C final : public UButtonIconLongPressWidget
{
public:
	class UWB_Common_LongpressItem_C*             LongPress_Button;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_LongpressKeyItem_C*          LongPress_Key;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHoverButton;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHoverKey;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Common_LongPressSet_C">();
	}
	static class UWB_Common_LongPressSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Common_LongPressSet_C>();
	}
};
static_assert(alignof(UWB_Common_LongPressSet_C) == 0x000008, "Wrong alignment on UWB_Common_LongPressSet_C");
static_assert(sizeof(UWB_Common_LongPressSet_C) == 0x0003B8, "Wrong size on UWB_Common_LongPressSet_C");
static_assert(offsetof(UWB_Common_LongPressSet_C, LongPress_Button) == 0x000390, "Member 'UWB_Common_LongPressSet_C::LongPress_Button' has a wrong offset!");
static_assert(offsetof(UWB_Common_LongPressSet_C, LongPress_Key) == 0x000398, "Member 'UWB_Common_LongPressSet_C::LongPress_Key' has a wrong offset!");
static_assert(offsetof(UWB_Common_LongPressSet_C, MouseClick) == 0x0003A0, "Member 'UWB_Common_LongPressSet_C::MouseClick' has a wrong offset!");
static_assert(offsetof(UWB_Common_LongPressSet_C, MouseHoverButton) == 0x0003A8, "Member 'UWB_Common_LongPressSet_C::MouseHoverButton' has a wrong offset!");
static_assert(offsetof(UWB_Common_LongPressSet_C, MouseHoverKey) == 0x0003B0, "Member 'UWB_Common_LongPressSet_C::MouseHoverKey' has a wrong offset!");

}

