#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_churchSave_Icon

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_churchSave_Icon.WB_churchSave_Icon_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_churchSave_Icon_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Save;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IconBook;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconPen;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_churchSave_Icon_C">();
	}
	static class UWB_churchSave_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_churchSave_Icon_C>();
	}
};
static_assert(alignof(UWB_churchSave_Icon_C) == 0x000008, "Wrong alignment on UWB_churchSave_Icon_C");
static_assert(sizeof(UWB_churchSave_Icon_C) == 0x0003C8, "Wrong size on UWB_churchSave_Icon_C");
static_assert(offsetof(UWB_churchSave_Icon_C, Save) == 0x0003B0, "Member 'UWB_churchSave_Icon_C::Save' has a wrong offset!");
static_assert(offsetof(UWB_churchSave_Icon_C, IconBook) == 0x0003B8, "Member 'UWB_churchSave_Icon_C::IconBook' has a wrong offset!");
static_assert(offsetof(UWB_churchSave_Icon_C, IconPen) == 0x0003C0, "Member 'UWB_churchSave_Icon_C::IconPen' has a wrong offset!");

}

