#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Common_ButtonHelp2

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Common_ButtonHelp2.WB_Common_ButtonHelp2_C
// 0x0028 (0x0350 - 0x0328)
class UWB_Common_ButtonHelp2_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Push_Key;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ItemCursor;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHover;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Common_ButtonHelp2_C">();
	}
	static class UWB_Common_ButtonHelp2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Common_ButtonHelp2_C>();
	}
};
static_assert(alignof(UWB_Common_ButtonHelp2_C) == 0x000008, "Wrong alignment on UWB_Common_ButtonHelp2_C");
static_assert(sizeof(UWB_Common_ButtonHelp2_C) == 0x000350, "Wrong size on UWB_Common_ButtonHelp2_C");
static_assert(offsetof(UWB_Common_ButtonHelp2_C, Push_Key) == 0x000328, "Member 'UWB_Common_ButtonHelp2_C::Push_Key' has a wrong offset!");
static_assert(offsetof(UWB_Common_ButtonHelp2_C, ItemCursor) == 0x000330, "Member 'UWB_Common_ButtonHelp2_C::ItemCursor' has a wrong offset!");
static_assert(offsetof(UWB_Common_ButtonHelp2_C, MouseClick) == 0x000338, "Member 'UWB_Common_ButtonHelp2_C::MouseClick' has a wrong offset!");
static_assert(offsetof(UWB_Common_ButtonHelp2_C, MouseHover) == 0x000340, "Member 'UWB_Common_ButtonHelp2_C::MouseHover' has a wrong offset!");
static_assert(offsetof(UWB_Common_ButtonHelp2_C, WindowBG) == 0x000348, "Member 'UWB_Common_ButtonHelp2_C::WindowBG' has a wrong offset!");

}

