#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Church_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Church_Root.WB_Church_Root_C
// 0x0030 (0x03F0 - 0x03C0)
class UWB_Church_Root_C final : public UCommonRootWidget
{
public:
	class UWB_ChurchMenu_ListPartyHeal_C*         ListPartyHeal;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ChurchMenu_ListPartyRevive_C*       ListPartyRevive;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ChurchSave_List_C*                  ListSaveLoad;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Church_List1_C*                     ListTop;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_GoldWindow_C*                WindowMoney;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_churchSave_Icon_C*                  WindowSaving;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Church_Root_C">();
	}
	static class UWB_Church_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Church_Root_C>();
	}
};
static_assert(alignof(UWB_Church_Root_C) == 0x000008, "Wrong alignment on UWB_Church_Root_C");
static_assert(sizeof(UWB_Church_Root_C) == 0x0003F0, "Wrong size on UWB_Church_Root_C");
static_assert(offsetof(UWB_Church_Root_C, ListPartyHeal) == 0x0003C0, "Member 'UWB_Church_Root_C::ListPartyHeal' has a wrong offset!");
static_assert(offsetof(UWB_Church_Root_C, ListPartyRevive) == 0x0003C8, "Member 'UWB_Church_Root_C::ListPartyRevive' has a wrong offset!");
static_assert(offsetof(UWB_Church_Root_C, ListSaveLoad) == 0x0003D0, "Member 'UWB_Church_Root_C::ListSaveLoad' has a wrong offset!");
static_assert(offsetof(UWB_Church_Root_C, ListTop) == 0x0003D8, "Member 'UWB_Church_Root_C::ListTop' has a wrong offset!");
static_assert(offsetof(UWB_Church_Root_C, WindowMoney) == 0x0003E0, "Member 'UWB_Church_Root_C::WindowMoney' has a wrong offset!");
static_assert(offsetof(UWB_Church_Root_C, WindowSaving) == 0x0003E8, "Member 'UWB_Church_Root_C::WindowSaving' has a wrong offset!");

}

