#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FieldButtonGuide_EventSkip_Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FieldButtonGuide_EventSkip_Item.WB_FieldButtonGuide_EventSkip_Item_C
// 0x0048 (0x0370 - 0x0328)
class UWB_FieldButtonGuide_EventSkip_Item_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SpeedUpRoop;                                       // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_LongPressSet_C*              ButtonIcon;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSpeed0;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSpeed1;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSpeed2;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconSpeedBase;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FieldButtonGuide_EventSkip_Item_C">();
	}
	static class UWB_FieldButtonGuide_EventSkip_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FieldButtonGuide_EventSkip_Item_C>();
	}
};
static_assert(alignof(UWB_FieldButtonGuide_EventSkip_Item_C) == 0x000008, "Wrong alignment on UWB_FieldButtonGuide_EventSkip_Item_C");
static_assert(sizeof(UWB_FieldButtonGuide_EventSkip_Item_C) == 0x000370, "Wrong size on UWB_FieldButtonGuide_EventSkip_Item_C");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, Out) == 0x000328, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, In) == 0x000330, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::In' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, SpeedUpRoop) == 0x000338, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::SpeedUpRoop' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, BG) == 0x000340, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, ButtonIcon) == 0x000348, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, IconSpeed0) == 0x000350, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::IconSpeed0' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, IconSpeed1) == 0x000358, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::IconSpeed1' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, IconSpeed2) == 0x000360, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::IconSpeed2' has a wrong offset!");
static_assert(offsetof(UWB_FieldButtonGuide_EventSkip_Item_C, IconSpeedBase) == 0x000368, "Member 'UWB_FieldButtonGuide_EventSkip_Item_C::IconSpeedBase' has a wrong offset!");

}

