#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FieldEfx_Item_05

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FieldEfx_Item_05.WB_FieldEfx_Item_05_C
// 0x0020 (0x0348 - 0x0328)
class UWB_FieldEfx_Item_05_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Zero0;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Zero1;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FieldEfx_Item_05_C">();
	}
	static class UWB_FieldEfx_Item_05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FieldEfx_Item_05_C>();
	}
};
static_assert(alignof(UWB_FieldEfx_Item_05_C) == 0x000008, "Wrong alignment on UWB_FieldEfx_Item_05_C");
static_assert(sizeof(UWB_FieldEfx_Item_05_C) == 0x000348, "Wrong size on UWB_FieldEfx_Item_05_C");
static_assert(offsetof(UWB_FieldEfx_Item_05_C, Out) == 0x000328, "Member 'UWB_FieldEfx_Item_05_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_FieldEfx_Item_05_C, In) == 0x000330, "Member 'UWB_FieldEfx_Item_05_C::In' has a wrong offset!");
static_assert(offsetof(UWB_FieldEfx_Item_05_C, Zero0) == 0x000338, "Member 'UWB_FieldEfx_Item_05_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_FieldEfx_Item_05_C, Zero1) == 0x000340, "Member 'UWB_FieldEfx_Item_05_C::Zero1' has a wrong offset!");

}

