#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FieldPlayerStatus_Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FieldPlayerStatus_Item.WB_FieldPlayerStatus_Item_C
// 0x0028 (0x03D8 - 0x03B0)
class UWB_FieldPlayerStatus_Item_C final : public UCommonWindowWidget
{
public:
	class UWB_Common_HP_C*                        HP;                                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Battle_StatusIcon_C*                ItemStatusEffect;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_MP_C*                        MP;                                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Flipbook_C*                         WB_Flipbook;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FieldPlayerStatus_Item_C">();
	}
	static class UWB_FieldPlayerStatus_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FieldPlayerStatus_Item_C>();
	}
};
static_assert(alignof(UWB_FieldPlayerStatus_Item_C) == 0x000008, "Wrong alignment on UWB_FieldPlayerStatus_Item_C");
static_assert(sizeof(UWB_FieldPlayerStatus_Item_C) == 0x0003D8, "Wrong size on UWB_FieldPlayerStatus_Item_C");
static_assert(offsetof(UWB_FieldPlayerStatus_Item_C, HP) == 0x0003B0, "Member 'UWB_FieldPlayerStatus_Item_C::HP' has a wrong offset!");
static_assert(offsetof(UWB_FieldPlayerStatus_Item_C, ItemStatusEffect) == 0x0003B8, "Member 'UWB_FieldPlayerStatus_Item_C::ItemStatusEffect' has a wrong offset!");
static_assert(offsetof(UWB_FieldPlayerStatus_Item_C, MP) == 0x0003C0, "Member 'UWB_FieldPlayerStatus_Item_C::MP' has a wrong offset!");
static_assert(offsetof(UWB_FieldPlayerStatus_Item_C, WB_Flipbook) == 0x0003C8, "Member 'UWB_FieldPlayerStatus_Item_C::WB_Flipbook' has a wrong offset!");
static_assert(offsetof(UWB_FieldPlayerStatus_Item_C, WindowBG) == 0x0003D0, "Member 'UWB_FieldPlayerStatus_Item_C::WindowBG' has a wrong offset!");

}

