#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FieldEfx_Guide_Window

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FieldEfx_Guide_Window.WB_FieldEfx_Guide_Window_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_FieldEfx_Guide_Window_C final : public UCommonWindowWidget
{
public:
	class UWB_FieldEfx_Guide_00_C*                Zero0;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FieldEfx_Guide_01_C*                Zero1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FieldEfx_Guide_02_List_C*           Zero2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FieldEfx_Guide_Window_C">();
	}
	static class UWB_FieldEfx_Guide_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FieldEfx_Guide_Window_C>();
	}
};
static_assert(alignof(UWB_FieldEfx_Guide_Window_C) == 0x000008, "Wrong alignment on UWB_FieldEfx_Guide_Window_C");
static_assert(sizeof(UWB_FieldEfx_Guide_Window_C) == 0x0003C8, "Wrong size on UWB_FieldEfx_Guide_Window_C");
static_assert(offsetof(UWB_FieldEfx_Guide_Window_C, Zero0) == 0x0003B0, "Member 'UWB_FieldEfx_Guide_Window_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_FieldEfx_Guide_Window_C, Zero1) == 0x0003B8, "Member 'UWB_FieldEfx_Guide_Window_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_FieldEfx_Guide_Window_C, Zero2) == 0x0003C0, "Member 'UWB_FieldEfx_Guide_Window_C::Zero2' has a wrong offset!");

}

