#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FieldMemoryPopUp_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FieldMemoryPopUp_Root.WB_FieldMemoryPopUp_Root_C
// 0x0020 (0x03E0 - 0x03C0)
class UWB_FieldMemoryPopUp_Root_C final : public UCommonRootWidget
{
public:
	class UWidgetAnimation*                       InOut_NextGuide;                                   // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InOut;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_FieldMemoryPopUp_Item_C*            ItemMemoryPopUp;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FieldNextGuidePopUp_Item_C*         ItemNextGuidePopUp;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_FieldMemoryPopUp_Root_C">();
	}
	static class UWB_FieldMemoryPopUp_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FieldMemoryPopUp_Root_C>();
	}
};
static_assert(alignof(UWB_FieldMemoryPopUp_Root_C) == 0x000008, "Wrong alignment on UWB_FieldMemoryPopUp_Root_C");
static_assert(sizeof(UWB_FieldMemoryPopUp_Root_C) == 0x0003E0, "Wrong size on UWB_FieldMemoryPopUp_Root_C");
static_assert(offsetof(UWB_FieldMemoryPopUp_Root_C, InOut_NextGuide) == 0x0003C0, "Member 'UWB_FieldMemoryPopUp_Root_C::InOut_NextGuide' has a wrong offset!");
static_assert(offsetof(UWB_FieldMemoryPopUp_Root_C, InOut) == 0x0003C8, "Member 'UWB_FieldMemoryPopUp_Root_C::InOut' has a wrong offset!");
static_assert(offsetof(UWB_FieldMemoryPopUp_Root_C, ItemMemoryPopUp) == 0x0003D0, "Member 'UWB_FieldMemoryPopUp_Root_C::ItemMemoryPopUp' has a wrong offset!");
static_assert(offsetof(UWB_FieldMemoryPopUp_Root_C, ItemNextGuidePopUp) == 0x0003D8, "Member 'UWB_FieldMemoryPopUp_Root_C::ItemNextGuidePopUp' has a wrong offset!");

}

