#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LoadingIcon_WindowItem00

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_LoadingIcon_WindowItem00.WB_LoadingIcon_WindowItem00_C
// 0x0018 (0x0340 - 0x0328)
class UWB_LoadingIcon_WindowItem00_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Loading;                                           // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IconBook;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconPen;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_LoadingIcon_WindowItem00_C">();
	}
	static class UWB_LoadingIcon_WindowItem00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LoadingIcon_WindowItem00_C>();
	}
};
static_assert(alignof(UWB_LoadingIcon_WindowItem00_C) == 0x000008, "Wrong alignment on UWB_LoadingIcon_WindowItem00_C");
static_assert(sizeof(UWB_LoadingIcon_WindowItem00_C) == 0x000340, "Wrong size on UWB_LoadingIcon_WindowItem00_C");
static_assert(offsetof(UWB_LoadingIcon_WindowItem00_C, Loading) == 0x000328, "Member 'UWB_LoadingIcon_WindowItem00_C::Loading' has a wrong offset!");
static_assert(offsetof(UWB_LoadingIcon_WindowItem00_C, IconBook) == 0x000330, "Member 'UWB_LoadingIcon_WindowItem00_C::IconBook' has a wrong offset!");
static_assert(offsetof(UWB_LoadingIcon_WindowItem00_C, IconPen) == 0x000338, "Member 'UWB_LoadingIcon_WindowItem00_C::IconPen' has a wrong offset!");

}

