#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Map2_NextGuide_Window1

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Map2_NextGuide_Window1.WB_Map2_NextGuide_Window1_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_Map2_NextGuide_Window1_C final : public UCommonWindowWidget
{
public:
	class UImage*                                 BGEffect;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Map2_NextGuide_List1_C*             ItemList;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBG;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Map2_NextGuide_Window1_C">();
	}
	static class UWB_Map2_NextGuide_Window1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Map2_NextGuide_Window1_C>();
	}
};
static_assert(alignof(UWB_Map2_NextGuide_Window1_C) == 0x000008, "Wrong alignment on UWB_Map2_NextGuide_Window1_C");
static_assert(sizeof(UWB_Map2_NextGuide_Window1_C) == 0x0003C8, "Wrong size on UWB_Map2_NextGuide_Window1_C");
static_assert(offsetof(UWB_Map2_NextGuide_Window1_C, BGEffect) == 0x0003B0, "Member 'UWB_Map2_NextGuide_Window1_C::BGEffect' has a wrong offset!");
static_assert(offsetof(UWB_Map2_NextGuide_Window1_C, ItemList) == 0x0003B8, "Member 'UWB_Map2_NextGuide_Window1_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWB_Map2_NextGuide_Window1_C, TitleBG) == 0x0003C0, "Member 'UWB_Map2_NextGuide_Window1_C::TitleBG' has a wrong offset!");

}

