#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBR_Zoo_Window3

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBR_Zoo_Window3.WB_MBR_Zoo_Window3_C
// 0x0050 (0x0400 - 0x03B0)
class UWB_MBR_Zoo_Window3_C final : public UCommonWindowWidget
{
public:
	class UWB_MBR_Zoo_Window3Item_C*              Zero0;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window3Item_C*              Zero1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window3Item_C*              Zero2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window3Item_C*              Zero3;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon2;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon3;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon4;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon5;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBR_Zoo_Window3_C">();
	}
	static class UWB_MBR_Zoo_Window3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBR_Zoo_Window3_C>();
	}
};
static_assert(alignof(UWB_MBR_Zoo_Window3_C) == 0x000008, "Wrong alignment on UWB_MBR_Zoo_Window3_C");
static_assert(sizeof(UWB_MBR_Zoo_Window3_C) == 0x000400, "Wrong size on UWB_MBR_Zoo_Window3_C");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, Zero0) == 0x0003B0, "Member 'UWB_MBR_Zoo_Window3_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, Zero1) == 0x0003B8, "Member 'UWB_MBR_Zoo_Window3_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, Zero2) == 0x0003C0, "Member 'UWB_MBR_Zoo_Window3_C::Zero2' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, Zero3) == 0x0003C8, "Member 'UWB_MBR_Zoo_Window3_C::Zero3' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, ItemIcon) == 0x0003D0, "Member 'UWB_MBR_Zoo_Window3_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, ItemIcon2) == 0x0003D8, "Member 'UWB_MBR_Zoo_Window3_C::ItemIcon2' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, ItemIcon3) == 0x0003E0, "Member 'UWB_MBR_Zoo_Window3_C::ItemIcon3' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, ItemIcon4) == 0x0003E8, "Member 'UWB_MBR_Zoo_Window3_C::ItemIcon4' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, ItemIcon5) == 0x0003F0, "Member 'UWB_MBR_Zoo_Window3_C::ItemIcon5' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window3_C, WindowBG) == 0x0003F8, "Member 'UWB_MBR_Zoo_Window3_C::WindowBG' has a wrong offset!");

}

