#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Map2_NowLocationEffect

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Map2_NowLocationEffect.WB_Map2_NowLocationEffect_C
// 0x0020 (0x0348 - 0x0328)
class UWB_Map2_NowLocationEffect_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       on;                                                // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ItemEffect0;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemEffect1;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemEffect2;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Map2_NowLocationEffect_C">();
	}
	static class UWB_Map2_NowLocationEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Map2_NowLocationEffect_C>();
	}
};
static_assert(alignof(UWB_Map2_NowLocationEffect_C) == 0x000008, "Wrong alignment on UWB_Map2_NowLocationEffect_C");
static_assert(sizeof(UWB_Map2_NowLocationEffect_C) == 0x000348, "Wrong size on UWB_Map2_NowLocationEffect_C");
static_assert(offsetof(UWB_Map2_NowLocationEffect_C, on) == 0x000328, "Member 'UWB_Map2_NowLocationEffect_C::on' has a wrong offset!");
static_assert(offsetof(UWB_Map2_NowLocationEffect_C, ItemEffect0) == 0x000330, "Member 'UWB_Map2_NowLocationEffect_C::ItemEffect0' has a wrong offset!");
static_assert(offsetof(UWB_Map2_NowLocationEffect_C, ItemEffect1) == 0x000338, "Member 'UWB_Map2_NowLocationEffect_C::ItemEffect1' has a wrong offset!");
static_assert(offsetof(UWB_Map2_NowLocationEffect_C, ItemEffect2) == 0x000340, "Member 'UWB_Map2_NowLocationEffect_C::ItemEffect2' has a wrong offset!");

}

