#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBRBattle_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBRBattle_Root.WB_MBRBattle_Root_C
// 0x0020 (0x03E0 - 0x03C0)
class UWB_MBRBattle_Root_C final : public UCommonRootWidget
{
public:
	class UWB_MBRBattle_TacticsList1_C*           TacticsList1;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleTactics_TacticsList_C*        TacticsList2;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_BattleTactics_TacticsWindow_C*      TacticsWindow;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBRBattle_TopList_C*                TopList;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBRBattle_Root_C">();
	}
	static class UWB_MBRBattle_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBRBattle_Root_C>();
	}
};
static_assert(alignof(UWB_MBRBattle_Root_C) == 0x000008, "Wrong alignment on UWB_MBRBattle_Root_C");
static_assert(sizeof(UWB_MBRBattle_Root_C) == 0x0003E0, "Wrong size on UWB_MBRBattle_Root_C");
static_assert(offsetof(UWB_MBRBattle_Root_C, TacticsList1) == 0x0003C0, "Member 'UWB_MBRBattle_Root_C::TacticsList1' has a wrong offset!");
static_assert(offsetof(UWB_MBRBattle_Root_C, TacticsList2) == 0x0003C8, "Member 'UWB_MBRBattle_Root_C::TacticsList2' has a wrong offset!");
static_assert(offsetof(UWB_MBRBattle_Root_C, TacticsWindow) == 0x0003D0, "Member 'UWB_MBRBattle_Root_C::TacticsWindow' has a wrong offset!");
static_assert(offsetof(UWB_MBRBattle_Root_C, TopList) == 0x0003D8, "Member 'UWB_MBRBattle_Root_C::TopList' has a wrong offset!");

}

