#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBRStatus_StatusWindow

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBRStatus_StatusWindow.WB_MBRStatus_StatusWindow_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_MBRStatus_StatusWindow_C final : public UCommonWindowWidget
{
public:
	class UWB_MBRStatus_StatusWindow_Item_C*      Zero0;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBRStatus_StatusWindow_Item_C*      Zero1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBRStatus_StatusWindow_Item_C*      Zero2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBRStatus_StatusWindow_C">();
	}
	static class UWB_MBRStatus_StatusWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBRStatus_StatusWindow_C>();
	}
};
static_assert(alignof(UWB_MBRStatus_StatusWindow_C) == 0x000008, "Wrong alignment on UWB_MBRStatus_StatusWindow_C");
static_assert(sizeof(UWB_MBRStatus_StatusWindow_C) == 0x0003C8, "Wrong size on UWB_MBRStatus_StatusWindow_C");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_C, Zero0) == 0x0003B0, "Member 'UWB_MBRStatus_StatusWindow_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_C, Zero1) == 0x0003B8, "Member 'UWB_MBRStatus_StatusWindow_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_C, Zero2) == 0x0003C0, "Member 'UWB_MBRStatus_StatusWindow_C::Zero2' has a wrong offset!");

}

