#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBREncount_Encount_WindowItem

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBREncount_Encount_WindowItem.WB_MBREncount_Encount_WindowItem_C
// 0x0018 (0x03C8 - 0x03B0)
class UWB_MBREncount_Encount_WindowItem_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Reset;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fight;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Party;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBREncount_Encount_WindowItem_C">();
	}
	static class UWB_MBREncount_Encount_WindowItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBREncount_Encount_WindowItem_C>();
	}
};
static_assert(alignof(UWB_MBREncount_Encount_WindowItem_C) == 0x000008, "Wrong alignment on UWB_MBREncount_Encount_WindowItem_C");
static_assert(sizeof(UWB_MBREncount_Encount_WindowItem_C) == 0x0003C8, "Wrong size on UWB_MBREncount_Encount_WindowItem_C");
static_assert(offsetof(UWB_MBREncount_Encount_WindowItem_C, Reset) == 0x0003B0, "Member 'UWB_MBREncount_Encount_WindowItem_C::Reset' has a wrong offset!");
static_assert(offsetof(UWB_MBREncount_Encount_WindowItem_C, Fight) == 0x0003B8, "Member 'UWB_MBREncount_Encount_WindowItem_C::Fight' has a wrong offset!");
static_assert(offsetof(UWB_MBREncount_Encount_WindowItem_C, Party) == 0x0003C0, "Member 'UWB_MBREncount_Encount_WindowItem_C::Party' has a wrong offset!");

}

