#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MiniMapMenu_Root

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MiniMapMenu_Root.WB_MiniMapMenu_Root_C
// 0x0068 (0x0428 - 0x03C0)
class UWB_MiniMapMenu_Root_C final : public UCommonRootWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 IconDoorKey;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconEchoFlute;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconFacility;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGhostShip;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGuideMain;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGuideSub;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconLocation;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconRemirama;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconTarget;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconVehicle;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MiniMapMenu_WindowMain_C*           WindowMain;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MiniMapMenu_Root_C">();
	}
	static class UWB_MiniMapMenu_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MiniMapMenu_Root_C>();
	}
};
static_assert(alignof(UWB_MiniMapMenu_Root_C) == 0x000008, "Wrong alignment on UWB_MiniMapMenu_Root_C");
static_assert(sizeof(UWB_MiniMapMenu_Root_C) == 0x000428, "Wrong size on UWB_MiniMapMenu_Root_C");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, Out) == 0x0003C0, "Member 'UWB_MiniMapMenu_Root_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, In) == 0x0003C8, "Member 'UWB_MiniMapMenu_Root_C::In' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconDoorKey) == 0x0003D0, "Member 'UWB_MiniMapMenu_Root_C::IconDoorKey' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconEchoFlute) == 0x0003D8, "Member 'UWB_MiniMapMenu_Root_C::IconEchoFlute' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconFacility) == 0x0003E0, "Member 'UWB_MiniMapMenu_Root_C::IconFacility' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconGhostShip) == 0x0003E8, "Member 'UWB_MiniMapMenu_Root_C::IconGhostShip' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconGuideMain) == 0x0003F0, "Member 'UWB_MiniMapMenu_Root_C::IconGuideMain' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconGuideSub) == 0x0003F8, "Member 'UWB_MiniMapMenu_Root_C::IconGuideSub' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconLocation) == 0x000400, "Member 'UWB_MiniMapMenu_Root_C::IconLocation' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconRemirama) == 0x000408, "Member 'UWB_MiniMapMenu_Root_C::IconRemirama' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconTarget) == 0x000410, "Member 'UWB_MiniMapMenu_Root_C::IconTarget' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, IconVehicle) == 0x000418, "Member 'UWB_MiniMapMenu_Root_C::IconVehicle' has a wrong offset!");
static_assert(offsetof(UWB_MiniMapMenu_Root_C, WindowMain) == 0x000420, "Member 'UWB_MiniMapMenu_Root_C::WindowMain' has a wrong offset!");

}

