#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBR_Entry_Window3Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBR_Entry_Window3Item.WB_MBR_Entry_Window3Item_C
// 0x0018 (0x0340 - 0x0328)
class UWB_MBR_Entry_Window3Item_C final : public UCommonItemWidget
{
public:
	class UImage*                                 MonsterImage_1;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Flipbook_C*                         WB_Flipbook;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBR_Entry_Window3Item_C">();
	}
	static class UWB_MBR_Entry_Window3Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBR_Entry_Window3Item_C>();
	}
};
static_assert(alignof(UWB_MBR_Entry_Window3Item_C) == 0x000008, "Wrong alignment on UWB_MBR_Entry_Window3Item_C");
static_assert(sizeof(UWB_MBR_Entry_Window3Item_C) == 0x000340, "Wrong size on UWB_MBR_Entry_Window3Item_C");
static_assert(offsetof(UWB_MBR_Entry_Window3Item_C, MonsterImage_1) == 0x000328, "Member 'UWB_MBR_Entry_Window3Item_C::MonsterImage_1' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window3Item_C, WB_Flipbook) == 0x000330, "Member 'UWB_MBR_Entry_Window3Item_C::WB_Flipbook' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window3Item_C, WindowBG) == 0x000338, "Member 'UWB_MBR_Entry_Window3Item_C::WindowBG' has a wrong offset!");

}

