#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBR_Entry_Window2

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBR_Entry_Window2.WB_MBR_Entry_Window2_C
// 0x0028 (0x03D8 - 0x03B0)
class UWB_MBR_Entry_Window2_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Push;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ItemIcon;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHover;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBR_Entry_Window2_C">();
	}
	static class UWB_MBR_Entry_Window2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBR_Entry_Window2_C>();
	}
};
static_assert(alignof(UWB_MBR_Entry_Window2_C) == 0x000008, "Wrong alignment on UWB_MBR_Entry_Window2_C");
static_assert(sizeof(UWB_MBR_Entry_Window2_C) == 0x0003D8, "Wrong size on UWB_MBR_Entry_Window2_C");
static_assert(offsetof(UWB_MBR_Entry_Window2_C, Push) == 0x0003B0, "Member 'UWB_MBR_Entry_Window2_C::Push' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window2_C, ItemIcon) == 0x0003B8, "Member 'UWB_MBR_Entry_Window2_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window2_C, MouseClick) == 0x0003C0, "Member 'UWB_MBR_Entry_Window2_C::MouseClick' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window2_C, MouseHover) == 0x0003C8, "Member 'UWB_MBR_Entry_Window2_C::MouseHover' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_Window2_C, WindowBG) == 0x0003D0, "Member 'UWB_MBR_Entry_Window2_C::WindowBG' has a wrong offset!");

}

