#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBR_Entry_List2Item_Status

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBR_Entry_List2Item_Status.WB_MBR_Entry_List2Item_Status_C
// 0x0040 (0x0368 - 0x0328)
class UWB_MBR_Entry_List2Item_Status_C final : public UCommonItemWidget
{
public:
	class UWB_MBR_Zoo_Window1Item_C*              Zero0;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero1;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero2;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero3;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero4;                                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero5;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero6;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MBR_Zoo_Window1Item_C*              Zero7;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBR_Entry_List2Item_Status_C">();
	}
	static class UWB_MBR_Entry_List2Item_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBR_Entry_List2Item_Status_C>();
	}
};
static_assert(alignof(UWB_MBR_Entry_List2Item_Status_C) == 0x000008, "Wrong alignment on UWB_MBR_Entry_List2Item_Status_C");
static_assert(sizeof(UWB_MBR_Entry_List2Item_Status_C) == 0x000368, "Wrong size on UWB_MBR_Entry_List2Item_Status_C");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero0) == 0x000328, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero1) == 0x000330, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero2) == 0x000338, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero2' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero3) == 0x000340, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero3' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero4) == 0x000348, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero4' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero5) == 0x000350, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero5' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero6) == 0x000358, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero6' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Entry_List2Item_Status_C, Zero7) == 0x000360, "Member 'UWB_MBR_Entry_List2Item_Status_C::Zero7' has a wrong offset!");

}

