#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Map2_Window4_Item1

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Map2_Window4_Item1.WB_Map2_Window4_Item1_C
// 0x0030 (0x0358 - 0x0328)
class UWB_Map2_Window4_Item1_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       PushButton;                                        // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ItemIcon2;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHover;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Map2_Window4_Item1_C">();
	}
	static class UWB_Map2_Window4_Item1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Map2_Window4_Item1_C>();
	}
};
static_assert(alignof(UWB_Map2_Window4_Item1_C) == 0x000008, "Wrong alignment on UWB_Map2_Window4_Item1_C");
static_assert(sizeof(UWB_Map2_Window4_Item1_C) == 0x000358, "Wrong size on UWB_Map2_Window4_Item1_C");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, PushButton) == 0x000328, "Member 'UWB_Map2_Window4_Item1_C::PushButton' has a wrong offset!");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, BG) == 0x000330, "Member 'UWB_Map2_Window4_Item1_C::BG' has a wrong offset!");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, ItemIcon) == 0x000338, "Member 'UWB_Map2_Window4_Item1_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, ItemIcon2) == 0x000340, "Member 'UWB_Map2_Window4_Item1_C::ItemIcon2' has a wrong offset!");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, MouseClick) == 0x000348, "Member 'UWB_Map2_Window4_Item1_C::MouseClick' has a wrong offset!");
static_assert(offsetof(UWB_Map2_Window4_Item1_C, MouseHover) == 0x000350, "Member 'UWB_Map2_Window4_Item1_C::MouseHover' has a wrong offset!");

}

