#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBRStatus_StatusWindow_Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBRStatus_StatusWindow_Item.WB_MBRStatus_StatusWindow_Item_C
// 0x0088 (0x0438 - 0x03B0)
class UWB_MBRStatus_StatusWindow_Item_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Damage_In;                                         // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_Out;                                         // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_In;                                          // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Damage_Pos00;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Damage_Pos01;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Damage_Pos02;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Damage_Pos03;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Damage_Pos04;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_HP_C*                        HP;                                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MonsterImage;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_MP_C*                        MP;                                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Battle_StatusIcon_Window_C*         StatusIcon;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Flipbook_C*                         WB_Flipbook;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Highlight;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Highlight2;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBRStatus_StatusWindow_Item_C">();
	}
	static class UWB_MBRStatus_StatusWindow_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBRStatus_StatusWindow_Item_C>();
	}
};
static_assert(alignof(UWB_MBRStatus_StatusWindow_Item_C) == 0x000008, "Wrong alignment on UWB_MBRStatus_StatusWindow_Item_C");
static_assert(sizeof(UWB_MBRStatus_StatusWindow_Item_C) == 0x000438, "Wrong size on UWB_MBRStatus_StatusWindow_Item_C");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_In) == 0x0003B0, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_In' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Reset) == 0x0003B8, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Reset' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Slide_Out) == 0x0003C0, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Slide_Out' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Slide_In) == 0x0003C8, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Slide_In' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_Pos00) == 0x0003D0, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_Pos00' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_Pos01) == 0x0003D8, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_Pos01' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_Pos02) == 0x0003E0, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_Pos02' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_Pos03) == 0x0003E8, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_Pos03' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Damage_Pos04) == 0x0003F0, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Damage_Pos04' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, HP) == 0x0003F8, "Member 'UWB_MBRStatus_StatusWindow_Item_C::HP' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, Image_7) == 0x000400, "Member 'UWB_MBRStatus_StatusWindow_Item_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, MonsterImage) == 0x000408, "Member 'UWB_MBRStatus_StatusWindow_Item_C::MonsterImage' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, MP) == 0x000410, "Member 'UWB_MBRStatus_StatusWindow_Item_C::MP' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, StatusIcon) == 0x000418, "Member 'UWB_MBRStatus_StatusWindow_Item_C::StatusIcon' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, WB_Flipbook) == 0x000420, "Member 'UWB_MBRStatus_StatusWindow_Item_C::WB_Flipbook' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, WindowBG_Highlight) == 0x000428, "Member 'UWB_MBRStatus_StatusWindow_Item_C::WindowBG_Highlight' has a wrong offset!");
static_assert(offsetof(UWB_MBRStatus_StatusWindow_Item_C, WindowBG_Highlight2) == 0x000430, "Member 'UWB_MBRStatus_StatusWindow_Item_C::WindowBG_Highlight2' has a wrong offset!");

}

