#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message_Window

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Message_Window.WB_Message_Window_C
// 0x0038 (0x03E8 - 0x03B0)
class UWB_Message_Window_C final : public UCommonWindowWidget
{
public:
	class UWidgetAnimation*                       Idle;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scroll;                                            // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowDown;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MessageWindowTextList_C*            List;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Left;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Middle;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG_Right;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Message_Window_C">();
	}
	static class UWB_Message_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Message_Window_C>();
	}
};
static_assert(alignof(UWB_Message_Window_C) == 0x000008, "Wrong alignment on UWB_Message_Window_C");
static_assert(sizeof(UWB_Message_Window_C) == 0x0003E8, "Wrong size on UWB_Message_Window_C");
static_assert(offsetof(UWB_Message_Window_C, Idle) == 0x0003B0, "Member 'UWB_Message_Window_C::Idle' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, Scroll) == 0x0003B8, "Member 'UWB_Message_Window_C::Scroll' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, ArrowDown) == 0x0003C0, "Member 'UWB_Message_Window_C::ArrowDown' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, List) == 0x0003C8, "Member 'UWB_Message_Window_C::List' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, WindowBG_Left) == 0x0003D0, "Member 'UWB_Message_Window_C::WindowBG_Left' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, WindowBG_Middle) == 0x0003D8, "Member 'UWB_Message_Window_C::WindowBG_Middle' has a wrong offset!");
static_assert(offsetof(UWB_Message_Window_C, WindowBG_Right) == 0x0003E0, "Member 'UWB_Message_Window_C::WindowBG_Right' has a wrong offset!");

}

