#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MBR_Zoo_Window2

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MBR_Zoo_Window2.WB_MBR_Zoo_Window2_C
// 0x0038 (0x03E8 - 0x03B0)
class UWB_MBR_Zoo_Window2_C final : public UCommonWindowWidget
{
public:
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero0;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero1;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero2;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero3;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero4;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WB_MBR_Zoo_Window2Item::UWB_MBR_Zoo_Window2Item_C* Zero5;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBG;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_MBR_Zoo_Window2_C">();
	}
	static class UWB_MBR_Zoo_Window2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MBR_Zoo_Window2_C>();
	}
};
static_assert(alignof(UWB_MBR_Zoo_Window2_C) == 0x000008, "Wrong alignment on UWB_MBR_Zoo_Window2_C");
static_assert(sizeof(UWB_MBR_Zoo_Window2_C) == 0x0003E8, "Wrong size on UWB_MBR_Zoo_Window2_C");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero0) == 0x0003B0, "Member 'UWB_MBR_Zoo_Window2_C::Zero0' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero1) == 0x0003B8, "Member 'UWB_MBR_Zoo_Window2_C::Zero1' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero2) == 0x0003C0, "Member 'UWB_MBR_Zoo_Window2_C::Zero2' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero3) == 0x0003C8, "Member 'UWB_MBR_Zoo_Window2_C::Zero3' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero4) == 0x0003D0, "Member 'UWB_MBR_Zoo_Window2_C::Zero4' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, Zero5) == 0x0003D8, "Member 'UWB_MBR_Zoo_Window2_C::Zero5' has a wrong offset!");
static_assert(offsetof(UWB_MBR_Zoo_Window2_C, WindowBG) == 0x0003E0, "Member 'UWB_MBR_Zoo_Window2_C::WindowBG' has a wrong offset!");

}

