#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Map2_List2Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Map2_List2Item.WB_Map2_List2Item_C
// 0x0018 (0x0340 - 0x0328)
class UWB_Map2_List2Item_C final : public UCommonItemWidget
{
public:
	class UImage*                                 ItemCursor;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_LongPressSet_C*              LongPress;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClick;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Map2_List2Item_C">();
	}
	static class UWB_Map2_List2Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Map2_List2Item_C>();
	}
};
static_assert(alignof(UWB_Map2_List2Item_C) == 0x000008, "Wrong alignment on UWB_Map2_List2Item_C");
static_assert(sizeof(UWB_Map2_List2Item_C) == 0x000340, "Wrong size on UWB_Map2_List2Item_C");
static_assert(offsetof(UWB_Map2_List2Item_C, ItemCursor) == 0x000328, "Member 'UWB_Map2_List2Item_C::ItemCursor' has a wrong offset!");
static_assert(offsetof(UWB_Map2_List2Item_C, LongPress) == 0x000330, "Member 'UWB_Map2_List2Item_C::LongPress' has a wrong offset!");
static_assert(offsetof(UWB_Map2_List2Item_C, MouseClick) == 0x000338, "Member 'UWB_Map2_List2Item_C::MouseClick' has a wrong offset!");

}

