#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Map2_LabelItem

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Map2_LabelItem.WB_Map2_LabelItem_C
// 0x0060 (0x0388 - 0x0328)
class UWB_Map2_LabelItem_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Push_Key_R;                                        // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push_Key_L;                                        // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push_R;                                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Push_L;                                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowLeft;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowRight;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ItemIcon;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Common_ButtonSet_C*                 ItemIcon2;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClickL;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseClickR;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHoverL;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseHoverR;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Map2_LabelItem_C">();
	}
	static class UWB_Map2_LabelItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Map2_LabelItem_C>();
	}
};
static_assert(alignof(UWB_Map2_LabelItem_C) == 0x000008, "Wrong alignment on UWB_Map2_LabelItem_C");
static_assert(sizeof(UWB_Map2_LabelItem_C) == 0x000388, "Wrong size on UWB_Map2_LabelItem_C");
static_assert(offsetof(UWB_Map2_LabelItem_C, Push_Key_R) == 0x000328, "Member 'UWB_Map2_LabelItem_C::Push_Key_R' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, Push_Key_L) == 0x000330, "Member 'UWB_Map2_LabelItem_C::Push_Key_L' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, Push_R) == 0x000338, "Member 'UWB_Map2_LabelItem_C::Push_R' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, Push_L) == 0x000340, "Member 'UWB_Map2_LabelItem_C::Push_L' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, ArrowLeft) == 0x000348, "Member 'UWB_Map2_LabelItem_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, ArrowRight) == 0x000350, "Member 'UWB_Map2_LabelItem_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, ItemIcon) == 0x000358, "Member 'UWB_Map2_LabelItem_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, ItemIcon2) == 0x000360, "Member 'UWB_Map2_LabelItem_C::ItemIcon2' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, MouseClickL) == 0x000368, "Member 'UWB_Map2_LabelItem_C::MouseClickL' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, MouseClickR) == 0x000370, "Member 'UWB_Map2_LabelItem_C::MouseClickR' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, MouseHoverL) == 0x000378, "Member 'UWB_Map2_LabelItem_C::MouseHoverL' has a wrong offset!");
static_assert(offsetof(UWB_Map2_LabelItem_C, MouseHoverR) == 0x000380, "Member 'UWB_Map2_LabelItem_C::MouseHoverR' has a wrong offset!");

}

