#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TownName_Item

#include "Basic.hpp"

#include "Nicola_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TownName_Item.WB_TownName_Item_C
// 0x0018 (0x0340 - 0x0328)
class UWB_TownName_Item_C final : public UCommonItemWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_TownName_Item_C">();
	}
	static class UWB_TownName_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TownName_Item_C>();
	}
};
static_assert(alignof(UWB_TownName_Item_C) == 0x000008, "Wrong alignment on UWB_TownName_Item_C");
static_assert(sizeof(UWB_TownName_Item_C) == 0x000340, "Wrong size on UWB_TownName_Item_C");
static_assert(offsetof(UWB_TownName_Item_C, Out) == 0x000328, "Member 'UWB_TownName_Item_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_TownName_Item_C, In) == 0x000330, "Member 'UWB_TownName_Item_C::In' has a wrong offset!");
static_assert(offsetof(UWB_TownName_Item_C, BG) == 0x000338, "Member 'UWB_TownName_Item_C::BG' has a wrong offset!");

}

